params_vlj = {
    # ============= КИНЕТИЧЕСКИЕ ПАРАМЕТРЫ (ASM1) =============
    'Y': 0.67,
    'mu_max': 3.5,
    'K_S': 120.0,
    'b': 0.15,
    'K_O': 0.5,
    'X_max': 8000,
    # ============= ГИДРАВЛИЧЕСКИЕ ПАРАМЕТРЫ =============
    'V': 5000,
    'Q': 1000,
    # ============= ВРЕМЯ УДЕРЖАНИЯ =============
    'HRT': 1,
    'SRT': 10.0,
    # ============= КОНЦЕНТРАЦИИ НА ВХОДЕ =============
    'S_in': 182.5,
    'S_bio_in': 150.0,
    'S_inert_in': 32.5,
    'X_in': 3000.0,
    'O_in': 1.5,
    # ============= ПАРАМЕТРЫ АЭРАЦИИ =============
    'kLa': 25.0,
    'O_sat': 8.0,
    # ============= РЕЦИРКУЛЯЦИЯ =============
    'r': 0.57,
    'X_r_max': 8000,
    'eta': 0.3,
    'tau_adapt': 36,
}

params_2 = {
    # ============= КИНЕТИЧЕСКИЕ ПАРАМЕТРЫ (ASM1) =============
    'Y': 0.67,
    'mu_max': 7.5,
    'K_S': 25.0,
    'b': 0.12,
    # ============= ВРЕМЯ УДЕРЖАНИЯ =============
    'HRT': 0.5,
    'SRT': 12.0,
    # ============= КОНЦЕНТРАЦИИ НА ВХОДЕ =============
    'S_bio_in': 125.0,
    'S_inert_in': 31.1,   
    'X_in': 3000.0,
    'O_in': 1.5,
    # ============= ПАРАМЕТРЫ АЭРАЦИИ =============
    'kLa': 40.0,
    'O_sat': 8.0,
    
    'NH_in': 30.2,         
}

params_vlg = {
    # ============= КИНЕТИЧЕСКИЕ ПАРАМЕТРЫ (ASM1) =============
    'Y': 0.67,
    'mu_max': 3.5,
    'K_S': 120.0,
    'b': 0.15,
    'K_O': 0.5,
    'X_max': 8000,
    # ============= ГИДРАВЛИЧЕСКИЕ ПАРАМЕТРЫ =============
    'V': 5000,
    'Q': 1000,
    # ============= ВРЕМЯ УДЕРЖАНИЯ =============
    'HRT': 5.0,
    'SRT': 10.0,
    # ============= КОНЦЕНТРАЦИИ НА ВХОДЕ (ПО ВОЛГОГРАДУ) =============
    'S_in': 250.0,
    'S_bio_in': 200.0,
    'S_inert_in': 50.0,
    'X_in': 3000.0,
    'O_in': 1.5,
    # ============= ПАРАМЕТРЫ АЭРАЦИИ =============
    'kLa': 25.0,
    'O_sat': 8.0,
    # ============= РЕЦИРКУЛЯЦИЯ =============
    'r': 0.57,
    'X_r_max': 8000,
    'eta': 0.3,
    'tau_adapt': 36
}


def get_city_params(city: str = 'vlg'):

  match city:
    case 'vlg':
      return params_vlg
    case 'vlj':
      return params_vlj
    case _:
      return params_2
